{
  "name": "UIImprovements",
  "version": "1.2.2",
  "author": "Witchy",
  "website": "",
  "description": "
Adds various improvements to the UI

[h1]FEATURES:[/h1]
[list]
[*][b]NEW!!![/b]Buttons on the top right next to the notifications to show the current count for animals.  Clicking on them will cycle through the animals and focus the camera on them.  The text will turn red if the count is over the limit.
[*]The current task now displays next to the portrait of each colonist.
[*]When opening the equipment panel to select a weapon/tool/armor/clothing to put into storage, if the owner of the furniture cannot equip it the button will be red.
[*]When conditions are met, a timer for the next migrant will appear in the notifications
[list]
[*]Red: Not enough points to purchase a positive trait or negative trait removal
[*]Yellow: Enough points to purchase a 'minor' (1 pt value) positive trait
[*]Green: Enough points to purchase a positive trait or negative trait removal
[/list]
[*]When an object has been marked for deletion, the 'Delete' button will be greyed out (black)
[/list]

Check the screenshots for examples.

If you have an idea to improve the UI, let me know and I'll do my best to implement it!

[h1]Changelog[/h1]
[list]
[*][b]1.2.2[/b] Fixed a crash on game loading.
[*][b]1.2.0[/b] Added new feature: Animal Cyclers buttons
[*][b]1.1.2[/b] Satisfaction points text now display the correct color.  Added some checks so the mod overall performs better.
[*][b]1.1.1[/b] Restored Furniture status button feature.  Fixed issue with migrant message.
[*][b]1.1.0[/b] Removed the info panels as they are now in the vanilla game.  Clicking on the current task in the portrait panel cannot cancel the current task (bugged).  I'll investigate later
[*][b]1.0.5[/b] Fixed bug where new equipment would not display correctly in the equipment overview
[*][b]1.0.4[/b] Fixed bug where the current task icon would appear under the satisfaction point icon
[*][b]1.0.3[/b] Fixed bug where new colonists' portraits would not display upon accepting migrants
[*][b]1.0.2[/b] Added the current task in the portrait panel
[*][b]1.0.1[/b] Added red buttons to equipment panel when owner cannot equip it.
[/list]

[h1]How does it work?[/h1]
If you'd like to see how I implemented my mods, feel free to browse the source code available on my [url=https://github.com/WitchyMods/FoundersFortuneMods]Github[/url]

[h1]Want to donate?[/h1]
My mods will always be free!
However, if you'd like to support my modding efforts, [b][url=https://www.buymeacoffee.com/WitchyMods]Buy Me A Coffee[/url][/b].

[h1]Contact[/h1]
If you'd like to report a bug or suggest an idea or need help with modding, join the official Founders' Fortune [url=https://discord.gg/GkhSZeT]Discord Channel[/url]

[h1]Credits[/h1]
Animal icons credits goes to 'iconixar' from flaticon.com
[list]
[url=https://www.flaticon.com/free-icon/cow_2911237]Cow[/url]
[url=https://www.flaticon.com/free-icon/pig_2911273]Pig[/url]
[url=https://www.flaticon.com/free-icon/sheep_2911292]Sheep[/url]
[/list]
",
  "compatibleVersions": [
    "Alpha 13.0.11",
    "Alpha 14.0"
  ]
}